Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G29B.tmx
Source language: en_us
Languages: zh_cn

source: Flannery O'Connor
zh_cn: 弗兰纳里·奥康纳的一生

source: When Flannery O'Connor was 5 years old, she purportedly taught her pet bantam chicken to walk backward.
zh_cn: 据说弗兰纳里 奥康纳（Flannery O'Connor）五岁时，便教会她所喜爱的矮种鸡倒退行走。

source: The stunt attracted the attention of the Pathe newsreel company, and a Yankee cameraman was dispatched to her family's backyard in Savannah, Ga., to document the trick.
zh_cn: 这绝活吸引了百代（Pathe）电影公司的注意，一名来自北方的摄像师还被派到奥康纳位于佐治亚州萨瓦纳市的家后院拍摄记录这一绝技。

source: O'Connor never saw the humorous short, though it was screened in many movie theaters across America in 1932.
zh_cn: 尽管该滑稽短片于1932年在美国众多电影院上映，但奥康纳从没看过。

source: Yet years later in an essay in Holiday magazine, she claimed the unlikely event "marked me for life."
zh_cn: 在多年后一篇发表在《假日》（Holiday）杂志上的文章中，她说这不太像真实的事件“给我留下终身的创伤”。

source: By the time she was wrote that 1961 essay, "The King of the Birds," O'Connor was a cult literary celebrity.
zh_cn: 到她1961年写下《鸟禽之王》（“The King of the Birds”）时，奥康纳已是拥有狂热追随者的文艺界名人了。

source: She had published two novels - "Wise Blood" (1952) and "The Violent Bear It Away" (1960)--as well as the collection of stories -"A Good Man Is Hard to Find" (1955) -- that truly put her on the map.
zh_cn: 她发表了两部小说--《智血》（“Wise Blood”）和《强暴夺魁》（“The Violent Bear It Away”），以及一部短篇小说集《好人难寻》（“A Good Man Is Hard to Find”），这些作品使她闻名于世。

source: The O'Connor family's antebellum home in Milledgeville, Ga., was featured in Newsweek; a quasi- glamorous portrait appeared in Harper's Bazaar; her work was excerpted in Vogue.
zh_cn: 《新闻周刊》（Newsweek）上刊登了一幅奥康纳二战前位于佐治亚州米利奇维尔（Milledgeville）的房屋的照片；《时尚芭莎》（Harper's Bazaar）则刊登一幅可谓魅力四射的奥康纳肖像；此外，《时尚》（Vogue）杂志摘录了她的作品。

source: She used her freakish chicken as a pretext to meditate on her uneasy relation to fame and popular culture, claiming that all the attention made her feel like a cross between "Roy Rogers's horse and Miss Watermelon of 1955."
zh_cn: 奥康纳以这奇特的小鸡为掩饰，思考了她与名誉以及流行文化之间那种令其不安的关系，并称这一切对她的关注，让她感觉自己像“罗伊罗杰的明星马和1955年夺冠的西瓜小姐”。 (罗杰的马被称作是影视界最聪明的马，参阅www.royrogersworld.com/Triger.htm—译者注）

source: Dying in 1964 of lupus at age 39, unmarried, having lived mostly on a dairy farm with her mother, O'Connor's life and work might then have been expected to fade from memory.
zh_cn: 1964年，年仅39岁的奥康纳死于红斑狼疮。她终身未嫁，大部分时间和她的母亲呆在农庄里。

source: She swore there would be no biographies as "lives spent between the house and the chicken yard do not make exciting copy."
zh_cn: 奥康纳在那时本以为自己这样的生活和工作会从人们的记忆中消失，她肯定没人会为她立传，因为“围绕房子和鸡圈转动的生活不会成就令人兴奋的作品。”

source: Yet The New York Times deemed a story in her collection, "Everything That Rises Must Converge,'' published eight months after her death, among "the few masterpieces of the form in English;" her "Complete Stories'' won a posthumous 1972 National Book Award; she was the first postwar American woman author in the canonic Library of America; the phrase "like something out of Flannery O'Connor" entered our language as shorthand for nailing many a funny, dark, askew moment.
zh_cn: 然而《纽约时报》（The New York Times）认为奥康纳小说集《上升的必将汇合》（“Everything That Rises Must Converge”）中的其中一篇短篇小说是“英语中有关写作形式的极少数经典之作”。该小说集在她去世八个月后出版发行。奥康纳的《短篇小说全集》（“Complete Stories”）则在她去世之后于1972年获得美国国家图书奖。她是二战后首位列入权威的“美国文库”的美国女作家。“有点弗兰纳里 奥康纳的味道”这样的短语走进我们的语言，它指的是那些诙谐、神秘和怪诞的时刻。

source: Like her backward chicken, O'Connor's fiction continues to fascinate by running counter to much trendy literary culture.
zh_cn: 和她后院的小鸡一样，奥康纳的小说正因其与许多流行文学和文化背道而驰而不断散发着迷人魅力。

source: Savannah
zh_cn: 萨瓦纳（Savannah）

source: Born in Savannah on March 25, 1925, Mary Flannery O'Connor was the only child of Edward, a real estate agent, and Regina.
zh_cn: 玛丽弗兰纳里奥康纳于1925年3月25日出生于萨瓦纳，是家中的独苗，父亲爱德华（Edward）是房地产开发商，母亲是瑞加娜（Regina）。

source: Living on Lafayette Square, in the shadow of St. John the Baptist Cathedral, she was raised in a minority Irish-Catholic community within the larger Protestant South, and was taught by the strict Sisters of Mercy at St. Vincent's Grammar School.
zh_cn: 美国南方以新教徒居多，而住在圣约翰教堂附近的拉菲特广场的奥康纳是在少数爱尔兰天主教社区中长大的。她在圣文森特语法学校的修道院受到严格的教育。

source: Writing and drawing ambidextrously from an early age, her first "book," lovingly bound by her father, was "My Relitives," a series of scathing satiric drawings and captions.
zh_cn: 奥康纳自小就擅长写作和绘画，她的第一部“作品”“My Relitives”是由他慈爱的父亲装订起来的一些尖刻讽刺的绘画和图片说明。

source: Her highly protected girlhood was shattered when her father developed lupus and died in early 1941, after briefly moving his family to Atlanta for a Depression-era FHA job.
zh_cn: 在经济大萧条时期，为了父亲在联邦房建管理局的工作，奥康纳一家搬到亚特兰大。不久之后，父亲患上红斑狼疮并于1941年初去世，奥康纳受尽百般呵护的童年也随之结束。

source: Milledgeville
zh_cn: 米利奇维尔（Milledgeville）

source: O'Connor's mother then took her to live with relatives in the Cline family home, an 1838 columned Federal clapboard house, briefly used as the governor's mansion when Milledgeville served as the antebellum capital of Georgia.
zh_cn: 奥康纳的母亲随后带奥康纳来到克莱因宅第（Cline family home），和亲戚住在一起。克莱因宅第是一所由联邦政府于1838年建造的房屋，装饰有圆柱和楔形板，在米利奇维尔成为战后佐治亚州的首府时，它曾临时作为州长的住所。

source: She passed her teen years in a strongly matriarchal world with Regina as well as her three aunts -- Mary, Katie, and Gertie.
zh_cn: 奥康纳与她的母亲瑞加娜和三位姨妈--玛丽（Mary）、凯特（Katie）和格蒂（Gertie）住在一起，在一种强烈的母权环境中度过了她的青少年。

source: O'Connor developed a high profile as class cartoonist at both PeabodyHigh School and the local Georgia State College for Women, as she produced painstaking linoleum-cut cartoons that were "single-frame satires" on campus life.
zh_cn: 奥康纳在皮博迪中学(Peabody High School)和当地的佐治亚州女子学院就读时，就作为校内漫画家而引人注目。她花了大量功夫创作麻胶版画，那些都是讽刺校园生活的“单格讽刺漫画”。

source: Admiring James Thurber, she submitted cartoons to The New Yorker magazine, receiving back "a lot of encouragin' rejection slips."
zh_cn: 奥康纳敬仰詹姆斯 瑟伯（James Thurber）（他是为《纽约客》杂志供稿的小说家和漫画家—译者注），也跟着把自己的漫画作品投给《纽约客》（The New Yorker）杂志，但回应她的是“许多鼓励性的回绝信”。

source: Up North
zh_cn: 北上

source: At first planning on a career as a political cartoonist, in the fall of 1945 O'Connor enrolled in the journalism graduate school at the State University of Iowa.
zh_cn: 奥康纳于1945年秋季入读爱荷华州立大学的新闻研究生院，她一开始计划当一名职业政治漫画家。

source: Within her first few weeks in Iowa City, she found her way to Paul Engle's Writers' Workshop, the first MFA program in the country, and switched her major.
zh_cn: 在爱荷华市的前几周，奥康纳发现了由保罗 安格尔（Paul Engle）组织的作家工作室，那是美国首个提供艺术硕士学位的研究项目，她因此转了专业。

source: Discovering her vocation as a writer, she dropped "Mary" from her name; had her first story, "The Geranium," published in Accent magazine; received a Rinehart fellowship to work on a novel.
zh_cn: 在发现自己要当一名作家后，奥康纳把“玛丽”从她的名字中剔除；在《音调》（The Accent）杂志上发表第一个故事《天竺葵》（“The Geranium”）；获得了莱因哈特（Rinehart）奖学金，开始创作长篇小说。

source: In 1948, she moved on to spend nine months at the artists' colony Yaddo, where she met the poet Robert Lowell; lived for six months, in 1949, in Manhattan, meeting her publisher Robert Giroux; boarded in Redding, Conn., with poet-translator Robert Fitzgerald, his wife Sally and their children, writing "Wise Blood.''
zh_cn: 1948年，她来到艺术家社区亚多（Yaddo），花了九个月的时间继续创作她的小说，并且在那里认识了诗人罗伯特 罗威尔（Robert Lowell）； 1949年，奥康纳在曼哈顿住了六个月，遇见了出版商罗伯特 基卢克斯（Robert Giroux）；随后移居到康涅狄格州的莱丁市（Redding），寄居在诗人兼翻译家的罗伯特 菲茨杰拉德（Robert Fitzgerald）家里，与其妻子萨利（Sally）和他们的孩子住在一起，创作小说《智血》。

source: Andalusia
zh_cn: 安达卢西亚

source: O'Connor developed a high fever on a train ride home to Georgia at Christmastime 1950.
zh_cn: 在1950年圣诞节期间乘坐火车回佐治亚州时，奥康纳发起高烧，随后被确诊和她父亲一样患上红斑狼疮。

source: She was diagnosed, like her father, with lupus erythematosus, and over the next year was in and out of hospitals in Milledgeville and at Emory University in Atlanta.
zh_cn: 在接下来的一年里，她出入米利奇维尔的各家医院和亚特兰大的埃默里大学。
